<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html xmlns="http://www.w3.org/1999/xhtml"
      xmlns:og="http://ogp.me/ns#"
      xmlns:fb="http://www.facebook.com/2008/fbml">
<head>

<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="fr">
<meta name="Description" content="Site sur l'histoire du Chiffre à travers les ages : des balbutiements des mathématiques à son utilisation moderne, un voyage passionnant au coeur du symbole mathématique par excellence ...">
<meta name="Keywords" content="chiffre,nombre,mathématique,maths,math,mathematiques,nombres,chiffres,histoire,mayas,codes,déchiffrage,dechiffrage">

<title>L'Histoire des Nombres : Le Chiffre</title>
<meta property="og:title" content="L'Histoire des Nombres : Le Chiffre"/>
<meta property="og:type" content="website"/>
<meta property="og:url" content="https://lechiffre.info"/>
<meta property="og:site_name" content="Le Chiffre"/>
<meta property="og:description"
    content="Site sur l'histoire du Chiffre à travers les ages : des balbutiements des mathématiques à son utilisation moderne, un voyage passionnant au coeur du symbole mathématique par excellence ..."/>

<LINK rel="stylesheet" type="text/css" href="../../style.css">

<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-12176511-2']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
   
</head>

<body>

<div id="content">
  <div id="banniere">
    <img SRC="../../Images/banniere.jpg" ALT="L'Histoire des nombres : le chiffre" BORDER=0 height=143 width=587>
  </div>
  <div id="titre">
    III Les applications
du chiffre<br />
    B) Les particularit&eacute;s du chiffre
  </div>
  <div id="contenu100">
 
<div id="menu-haut">

<a href="../../page_som.html"><img SRC="../../Images/back_som2.gif" ALT="Retour au sommaire" NOSAVE BORDER=0 height=37 width=122></a><a href="../A-Equations/titre1.html"><img SRC="../../Images/back_start.gif" ALT="DÈbut du chapitre" NOSAVE BORDER=0 height=38 width=122></a>
<a href="../A-Equations/titre1.html"><img SRC="../../Images/back_back.gif" ALT="Chapitre prÈcÈdent" NOSAVE BORDER=0 height=37 width=122></a><a href="../C-Nombres/titre1.html"><img SRC="../../Images/back_next.gif" ALT="Chapitre suivant" NOSAVE BORDER=0 height=37 width=122></a>


</div>

<hr>
<br />

<p>

<table CELLSPACING=0 CELLPADDING=0 WIDTH="800" >
<tr>
<td WIDTH="20"></td>

<td WIDTH="660"><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp; Depuis son invention, le chiffre a &eacute;t&eacute; un moyen original de se divertir, de poser des &eacute;nigmes, de communiquer , etc ... En effet, le chiffre rec&egrave;le de petites particularit&eacute;s qui en font un outil sp&eacute;cial pour l'homme.&nbsp; Un des exemples les plus frappant de cet originalit&eacute; et de cette complexit&eacute; du chiffre est bien le carr&eacute; magique.</font></font>
<center>
<p><b><font face="Arial,Helvetica"><font size=+1>1) Le carr&eacute; magique</font></font></b><a NAME="cib1"></a></center>

<p><font face="Arial,Helvetica"><font size=+1>Dans le carr&eacute; magique,
les chiffres se parent de vertus extraordinaires :</font></font>
<center>
<p><b><font face="Arial,Helvetica"><font size=+2>4&nbsp;&nbsp;&nbsp;&nbsp;
9&nbsp;&nbsp;&nbsp;&nbsp; 2</font></font></b>
<br><b><font face="Arial,Helvetica"><font size=+2>3&nbsp;&nbsp;&nbsp;&nbsp;
5&nbsp;&nbsp;&nbsp;&nbsp; 7</font></font></b>
<br><b><font face="Arial,Helvetica"><font size=+2>8&nbsp;&nbsp;&nbsp;&nbsp;
1&nbsp;&nbsp;&nbsp;&nbsp; 6</font></font></b></center>

<p><font face="Arial,Helvetica"><font size=+1>La somme des chiffres de ce carr&eacute; magique est &eacute;gale &agrave; 15 dans toutes les directions. Ce carr&eacute; poss&egrave;de le pouvoir d'op&eacute;rer des charmes, de faire d&eacute;couvrir des tr&eacute;sors cach&eacute;s, d'&eacute;loigner l'incendie, de pr&eacute;server des accidents. Pour les juifs, le caract&egrave;re exceptionnel de ce carr&eacute; magique tenait &agrave; ce que 15 en h&eacute;breu s'&eacute;crit avec les deux premi&egrave;res lettres de J&eacute;hovah. Les chiffres tiennent une place importante dans la Cabale et dans le nouveau Testament, tout au long de l'apocalypse de Saint Jean o&ugrave; il est question notamment de la b&ecirc;te qui monte de la terre et dont le nombre est 666. Nombres d'initi&eacute;s num&eacute;rologues ont crus reconna&icirc;tre N&eacute;ron dans ce monstre, d'autres assurent qu'il s'agit de Napol&eacute;on. Certains de nos contemporains n'ont pas renonc&eacute;s &agrave; percer les myst&egrave;res attach&eacute;s au chiffre; mais ils utilisent un vocabulaire r&eacute;nov&eacute; inspir&eacute; de la <a href="../../page_themes.html#psychanalyse">psychanalyse</a>,
qui leur permet d&eacute;sormais de s'interroger sur la symboliques des
nombres .</font></font>
<center>
<p><img SRC="../../Images/p145.jpg" ALT="Jeu en ivoire" NOSAVE BORDER=0 height=247 width=331>
<p><font face="Arial,Helvetica"><font size=+1>Jeu en ivoire permettant
de construire des carr&eacute;s magiques</font></font>
<p><img SRC="../../Images/p142.gif" ALT="&quot;La mÈlancolie&quot;, de Durer" NOSAVE BORDER=0 height=480 width=387>
<br><font face="Arial,Helvetica"><font size=+1>Sur cette gravure de Durer,
La m&eacute;lancolie, on d&eacute;couvre en haut &agrave; droite un carr&eacute;
magique d'ordre 4. Ce carr&eacute; est dit parfait car la somme dans tous
les sens est &eacute;gale &agrave; 34, de plus, si on additionne les chiffres
connexes 4 &agrave; 4, on trouve &eacute;galement 34. On poss&egrave;de
aujourd'hui la formule g&eacute;n&eacute;rale qui permet de composer des
carr&eacute;s magiques d'ordre quelconque.</font></font>
<p><b><font face="Arial,Helvetica"><font size=+1>2) Des chiffres pour coder</font></font></b><a NAME="cib2"></a></center>

<p><br>
<p><font face="Arial,Helvetica"><font size=+1>&nbsp;Lorsqu'ils se substituent
au langage, les chiffres servent &agrave; masquer un message qui n'est
destin&eacute; qu'&agrave; certaines personnes. Dans le cas le plus terre-&agrave;-terre,
les chiffres sont utilis&eacute;es pour coder un texte qu'on veut dissimuler
&agrave; l'ennemi. On sait le r&ocirc;le des <a href="../../page_themes.html#bureau">bureaux
du chiffre</a> dans la vie des unit&eacute;s militaires, des ambassades et m&ecirc;me aujourd'hui des grandes entreprises. On connait aussi le travail inverse des&nbsp;d&eacute;crypteurs qui cherchent &agrave; percer les secrets qu'on prend tant de soin &agrave; leur cacher. Il y a des exemples fameux de messages d&eacute;crypt&eacute;s qui ont permis d'&eacute;viter de terribles revers, tel celui qui incita le g&eacute;n&eacute;ral Mangin &agrave; intervenir &agrave; M&eacute;ry-Courcelles le 11 juin 1918 et lui donna aussi l'occasion de stopper l'offensive allemande.&nbsp;</font></font>
<center>
<p><img SRC="../../Images/p146.gif" ALT="Diagrammes bifides" NOSAVE BORDER=0 height=157 width=469></center>

<p><font face="Arial,Helvetica"><font size=+1>&nbsp;D'autres messages d&eacute;crypt&eacute;s n'ont pas suscit&eacute;s l'int&eacute;r&ecirc;t qu'ils m&eacute;ritaient : par exemple, celui qui annoncait l'attaque japonaise de Pearl Harbour . D'autres messages &agrave; contenu moins concret peuvent &eacute;galement comporter des chiffres. Nous voulons parler i&ccedil;i des messages dont le d&eacute;cryptement doit en principe r&eacute;v&eacute;ler aux initi&eacute;s les voies secr&egrave;tes menant &agrave; la d&eacute;couverte de la v&eacute;rit&eacute;. La tradition en la mati&egrave;re est surrabondante.</font></font>
<p><font face="Arial,Helvetica"><font size=+1>&nbsp;Les pythagoriciens par exemple prirent le nombre pour point de d&eacute;part de leur r&eacute;flections. Le nombre &eacute;tait, selon eux : &laquo;le support de la v&eacute;rit&eacute;, le maillon de la cha&icirc;ne qui constitue la prison dans laquelle l'unit&eacute; divine a renferm&eacute; l'univers.&raquo;.</font></font>
<center>
<p><img SRC="../../Images/came.jpg" ALT="Came magique" NOSAVE BORDER=0 height=340 width=251></center>

<p><font face="Arial,Helvetica"><font size=+1>Came magique tib&eacute;taine.
D'origine chinoise, les cames sont issues de la magie. Ces objets sont
myst&eacute;rieux: on peut y retrouver des codes, ainsi que des messages
cach&eacute;s.</font></font>
<center>
<p><b><font face="Arial,Helvetica"><font size=+1>3)&nbsp; Des chiffres
pour les machines</font></font></b><a NAME="cib3"></a></center>

<p><font face="Arial,Helvetica"><font size=+1>&nbsp;Il existe entre la
machine et l'utilisateur un probl&egrave;me de traduction.Si tr&egrave;s
t&ocirc;t, l'ordinateur a &eacute;t&eacute; un fort en expression, il a
pris du retard dans la compr&eacute;hension. Il lui est facile, en effet,
d'&eacute;diter sur machine &agrave; &eacute;crire, par exemple, les r&eacute;sultats
de ses travaux sous une forme intelligible pour nous : il lui suffit, pour
cela, de faire correspondre &agrave; chaque code qu'il produit le chiffre
correspondant, &agrave; partir d'une sorte de lexique dont il dispose.
La d&eacute;marche inverse, en revanche, impossible jusqu'&agrave; ces
derni&egrave;res ann&eacute;es, demeure pour lui tr&egrave;s d&eacute;licates.
Cela tient &agrave; ce que le processus d'identification des formes, qui
nous permet de lire, est un fait de perception extr&ecirc;mement complexe
o&ugrave; l'oeil et le cerveau interviennent concurremment.&nbsp;</font></font>
<center>
<p><img SRC="../../Images/axis1.gif" ALT="Diagramme de correspondance binaire" NOSAVE BORDER=0 height=187 width=148></center>

<p><font face="Arial,Helvetica"><font size=+1>&nbsp; De l&agrave; vient la n&eacute;cessit&eacute; de traduire en code toute information destin&eacute;e &agrave; l'ordinateur, qui ne sait enregistrer et traiter que deux sortes de signaux, l'absence ou la pr&eacute;sence d'impulsion &eacute;lectrique. Toute information qui lui est destin&eacute; doit ainsi &ecirc;tre cod&eacute;e par des suites de 0 et de 1, constituant des nombres binaires, traduction en langage machine des chiffres que nous employons. Pour coder les chiffres d&eacute;cimaux, des suites de quatre signes binaires sont n&eacute;cessaires. Il est possible, certes, de produire manuellement&nbsp; ces codes sur une bande de papier se d&eacute;roulant r&eacute;guli&egrave;rement et pas &agrave; pas, en perforant un trou pour &eacute;crire 1 et en ne perforant pas pour 0 ; mais il est pr&eacute;f&eacute;rable de recourir &agrave; un codage un peu plus &eacute;volu&eacute;, comme celui utilis&eacute; sur les cartes m&eacute;canographiques o&ugrave; on &eacute;crit comme sur une port&eacute;e musicale qui comporterait dix lignes, une pour chaque chiffre. Il suffit dans ce cas o&ugrave; en progressant de colonne en colonne o&ugrave; d'un seul trou correspondant au&nbsp; chiffre pour que l'ordinateur sache transformer cette perforation unique en un code &agrave; quatre signes binaires.&nbsp;</font></font>
<center>
<p><img SRC="../../Images/p154.gif" ALT="Carte mÈcanographique perforÈe" NOSAVE BORDER=0 height=240 width=558></center>
<font face="Arial,Helvetica"><font size=+1>La perforation sur cartes m&eacute;canographiques ou sur ruban n&eacute;cessite un appareil de tr&egrave;s grande pr&eacute;cision m&eacute;canique ; aussi a-t-on cherch&eacute; &agrave; s'en passer en rempla&ccedil;ant, par exemple, les perforations par des marques &agrave; l'encre ou au crayon. Ces marques, faites &agrave; la main, n'ont pas la pr&eacute;cision des perforations m&eacute;caniques et sont donc parfois plus difficiles &agrave; lire par la machine &agrave; cause de leur intensit&eacute; variable et de leur position relativement floue sur la ligne et dans les colonnes. Les marques peuvent &ecirc;tre constitu&eacute;es de d&eacute;p&ocirc;ts de mati&egrave;re magn&eacute;tique dont l'inter&ecirc;t tient &agrave; ce que la nature tr&egrave;s particuli&egrave;re des signaux qu'ils d&eacute;livrent les rend tr&egrave;s distincts, pour la machine, de toutes les salissures non magn&eacute;tiques pouvant se trouver sur la carte.</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;C'est pourquoi, tr&egrave;s
t&ocirc;t, on a cherch&eacute; &agrave; simplifier la communication humain-ordinateur
en imaginant, au lieu du codage manuel, des syt&egrave;mes qui permettent
une lecture automatique directe &agrave; partir des documents portant l'information.</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;Les premi&egrave;res applications de syst&egrave;mes permettant la lecture automatique ont exploit&eacute; l'id&eacute;e selon laquelle un signe graphique, astucieusement dessin&eacute;, peut simultan&eacute;ment contenir les &eacute;l&eacute;ments d'information cod&eacute;e appropri&eacute;s &agrave; la lecture par machine et pr&eacute;senter une forme g&eacute;n&eacute;rale lisible par l'homme. Ces &eacute;l&eacute;ments cod&eacute;s peuvent &ecirc;tre, par exemple, des b&acirc;tonnets rendus significatifs par leur &eacute;cartement, leur &eacute;paisseur, leur orientation, leur dimension ou leur position respective. Ces b&acirc;tonnets sont imprim&eacute;s avec de l'encre contenant de l'oxyde de fer magn&eacute;tisable. Ces caract&egrave;res constituent la famille des caract&egrave;res &agrave; lecture magn&eacute;tique ; le plus utilis&eacute; &eacute;tant le CMC 7.</font></font>
<table WIDTH="100%" >
<tr>
<td><img SRC="../../Images/CMC7.gif" NOSAVE BORDER=0 height=183 width=188></td>

<td><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp; Sous son aspect
cod&eacute;, chaque caract&egrave;re du CMC 7 est compos&eacute; de sept
b&acirc;tonnets verticaux, d&eacute;limitant six intervalles qui peuvent
&ecirc;tre courts ou longs. Lorsque le caract&egrave;re entre dans la machine,&nbsp;
il passe sous une t&ecirc;te de lecture qui d&eacute;tecte les variations
de champ magn&eacute;tique rencontr&eacute;es. Le temps qui s&eacute;pare
deux impulsions permet de conna&icirc;tre s'il s'agit d'un intervalle court
ou long. A la derni&egrave;re impulsion du caract&egrave;re, l'ordinateur
a re&ccedil;u une suite de longues et de br&egrave;ves sp&eacute;cifiant
sous une forme binaire ( 0 et 1) le signe lu. Afin de rendre le CMC 7 lisible
&agrave; l'oeil humain, il a suffi de superposer sur les b&acirc;tonnets
verticaux des pochoirs donnant &agrave; chaque grille cod&eacute;e la forme
usuelle du caract&egrave;re correspondant.&nbsp;</font></font></td>

<td><img SRC="../../Images/CMC7_2.gif" NOSAVE BORDER=0 height=286 width=89></td>
</tr>
</table>

<br>&nbsp;
<p><font face="Arial,Helvetica"><font size=+1>&nbsp;</font></font></td>
</tr>
</table>


</p>

</div>

 <div id="footer">
    Copyright Cyril / Nicolas / Pierre 2011
  </div>
</div>
</body>
</html>
