<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html xmlns="http://www.w3.org/1999/xhtml"
      xmlns:og="http://ogp.me/ns#"
      xmlns:fb="http://www.facebook.com/2008/fbml">
<head>

<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="fr">
<meta name="Description" content="Site sur l'histoire du Chiffre à travers les ages : des balbutiements des mathématiques à son utilisation moderne, un voyage passionnant au coeur du symbole mathématique par excellence ...">
<meta name="Keywords" content="chiffre,nombre,mathématique,maths,math,mathematiques,nombres,chiffres,histoire,mayas,codes,déchiffrage,dechiffrage">

<title>L'Histoire des Nombres : Le Chiffre</title>
<meta property="og:title" content="L'Histoire des Nombres : Le Chiffre"/>
<meta property="og:type" content="website"/>
<meta property="og:url" content="http://lechiffre.free.fr"/>
<meta property="og:site_name" content="Le Chiffre"/>
<meta property="og:description"
    content="Site sur l'histoire du Chiffre à travers les ages : des balbutiements des mathématiques à son utilisation moderne, un voyage passionnant au coeur du symbole mathématique par excellence ..."/>

<LINK rel="stylesheet" type="text/css" href="../../style.css">

<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-12176511-2']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
   
</head>

<body>

<div id="content">
  <div id="banniere">
    <img SRC="../../Images/banniere.jpg" ALT="L'Histoire des nombres : le chiffre" BORDER=0 height=143 width=587>
  </div>
  <div id="titre">
    II Le chiffre, base de tout nombre<br />
    A) Les diff&eacute;rents syst&egrave;mes de num&eacute;rotation
  </div>
  <div id="contenu100">
 
<div id="menu-haut">
<a href="../../page_som.html"><img SRC="../../Images/back_som2.gif" ALT="Retour au sommaire" NOSAVE BORDER=0 height=37 width=122></a>
<a href="titre1.html"><img SRC="../../Images/back_start.gif" ALT="DÈbut du chapitre" NOSAVE BORDER=0 height=38 width=122></a>
<a href="../../chapter1/D-Etymologie/titre1.html"><img SRC="../../Images/back_back.gif" ALT="Chapitre prÈcÈdent" NOSAVE BORDER=0 height=37 width=122></a>
<a href="../B-Familles/titre1.html"><img SRC="../../Images/back_next.gif" ALT="Chapitre suivant" NOSAVE BORDER=0 height=37 width=122></a>

</div>

<hr>
<br />

<p>

<table CELLSPACING=0 CELLPADDING=0 WIDTH="800" >
<tr>
<td WIDTH="20"></td>

<td WIDTH="660">
<center><b><font face="Arial,Helvetica"><font size=+1>1) Les symbolisations
du nombre avant la base</font></font></b><a NAME="cib1"></a></center>

<p><font face="Arial,Helvetica"><font size=+1>&nbsp;Une fois que l'&ecirc;tre
humain eut d&eacute;couvert la notion de nombre, et ayant compris la diff&eacute;rence
entre les <a href="../../page_themes.html#cardinal">nombres cardinaux</a>
et <a href="../../page_themes.html#ordinal">ordinaux</a>, il fut conduit &agrave; changer les instruments qui lui servaient &agrave; compter (cailloux, coquillages, b&acirc;tonnets, colliers de perles, gestes relatifs &agrave; des parties du corps, etc...). Et c'est ainsi que ces instruments sont devenus de v&eacute;ritables symboles num&eacute;riques, bien plus pratique pour compter, retenir et calculer.</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;Un autre progr&egrave;s
fut r&eacute;alis&eacute; avec la cr&eacute;ation des noms de nombres,
permettant alors une d&eacute;signation orale beaucoup plus pr&eacute;cise
des quantit&eacute;s, ainsi que des notions abstraites.</font></font>
<center><img SRC="../../Images/T1p65.gif" NOSAVE BORDER=0 height=96 width=249></center>

<p><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp; Ce qui avait &eacute;t&eacute; exprim&eacute; jusque l&agrave; dans le langage parl&eacute;, fut simplement des mod&eacute;lisations n'ayant apparemment aucun rapport les unes avec les autres : les nombres &eacute;taient d&eacute;crits au moyen de termes intuitifs, souvent en rapport direct avec la nature et le monde environnant :</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;le Soleil ou la Lune
pour un ; les yeux ou les ailes d'un oiseau pour deux ; le tr&egrave;fle,
la multitude ou la foule pour trois, les pattes d'un animal pour quatre
...</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;Par la suite, les choses se structur&egrave;rent un petit peu avec l'utilisation du corps humain. On commen&ccedil;a donc par des descriptions du genre : le pouce, pris pour commencer, pour 1; lev&eacute; avec le doigt pr&eacute;c&eacute;dent pour deux ; le doigt qui divise &eacute;galement pour 3 ; tous les doigts lev&eacute;s sauf un pour 4 ; la main pour 5, etc ...</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;Mais la symbolisation concr&egrave;te et l'expression orale des nombres ne furent pas les seules possibilit&eacute;s exploit&eacute;es par l'homme au cours des &acirc;ges. Il y eut aussi, mais beaucoup plus tard, la symbolisation &eacute;crite : celle qui met des chiffres &agrave; contribution, c'est &agrave; dire des signes graphiques de toute sorte (traits grav&eacute;es, dessin&eacute;s ou peints, marques en creux sur l'argile ou sur la pierre, signes figuratifs, lettres de l'alphabet, signes conventionnels, etc ...). Ces cr&eacute;ations furent &eacute;videmment tr&egrave;s importantes car elles permirent de substituer &agrave; toute &laquo; op&eacute;ration &raquo; sur les choses concr&egrave;tes,&nbsp; l' &laquo;op&eacute;ration&raquo; correspondante sur les symboles num&eacute;riques.</font></font>
<center>
<p><b><font face="Arial,Helvetica"><font size=+1>2) Qu'est ce qu'une base
?</font></font></b><a NAME="cib2"></a></center>

<p><font face="Arial,Helvetica"><font size=+1>&nbsp;Pour symboliser les
nombres, l'homme disposa ainsi de deux principes : l'un, que l'on peut
qualifier de cardinal, qui consiste &agrave; adopter d&egrave;s le d&eacute;part
un &laquo;symbole-&eacute;talon&raquo; comme repr&eacute;sentant l'unit&eacute;
et &agrave; r&eacute;p&eacute;ter ce dernier autant de fois que le nombre
consid&eacute;r&eacute; contient d'unit&eacute;s ; l'autre, que l'on peut
qualifier d'ordinal, qui consiste &agrave; attribuer &agrave; chaque nombre
un symbole original, et donc &agrave; envisager une succession de symboles
n'ayant aucun rapport les uns avec les autres.</font></font>
<center><img SRC="../../Images/T1p67f1.gif" NOSAVE BORDER=0 height=164 width=225></center>
<font face="Arial,Helvetica"><font size=+1>Selon le premier principe, les quatre premiers nombres par exemple sont donc repr&eacute;sent&eacute;s par une simple r&eacute;p&eacute;tition d'autant de fois le nom du nombre 1, ou encore par l'alignement, la juxtaposition ou la superposition d'autant de cailloux, de doigts, d'encoches, de traits ou de ronds, repr&eacute;sentant l'unit&eacute;.</font></font>
<center><img SRC="../../Images/T1p72f2.2.gif" NOSAVE BORDER=0 height=198 width=282></center>
<font face="Arial,Helvetica"><font size=+1>Selon l'autre principe, en revanche,
les m&ecirc;mes nombres sont repr&eacute;sent&eacute;s par des mots, des
objets, des gestes ou des signes, tous diff&eacute;rents les uns des autres.</font></font>
<center><img SRC="../../Images/T1p72f2.3.gif" NOSAVE BORDER=0 height=169 width=267></center>

<p><font face="Arial,Helvetica"><font size=+1>Partant de l'une ou l'autre de ces deux r&egrave;gles fondamentales, l'homme put d&egrave;s lors apprendre &agrave; concevoir des ensembles de plus en plus &eacute;tendus. Mais dans les deux cas, il se heurta au d&eacute;but &agrave; de grandes difficult&eacute;s. Pour repr&eacute;senter des nombres de plus en plus grand, on ne pouvait &eacute;videmment pas multiplier ind&eacute;finiment des cailloux, des b&acirc;tonnets, des encoches ou des noeuds de cordelettes ; et ni le nombre des doigts de la main, ni celui des parties du corps n'&eacute;tait extensible &agrave; volont&eacute;. On ne pouvait pas non plus r&eacute;p&eacute;ter un m&ecirc;me mot d'une mani&egrave;re illimit&eacute;e ni cr&eacute;er &agrave; l'infini de nouveaux noms de nombre ou des symboles originaux : imaginez seulement&nbsp; ce que nous devrions aujourd'hui d&eacute;ployer comme symboles pour exprimer simplement la quantit&eacute; de centimes &eacute;gale au <a href="../../page_themes.html#billgates">salaire
annuel de Bill Gates</a> !</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;L'&ecirc;tre humain se trouva d&eacute;sormais confront&eacute; &agrave; un probl&egrave;me insurmontable &agrave; premi&egrave;re vue : comment d&eacute;signer des nombres &eacute;lev&eacute;s avec le moins de symboles possibles ? Que l'on ait trouv&eacute; une solution &agrave; ce d&eacute;licat probl&egrave;me, voila qui prouve bien que l'homme fait preuve d'une grande ing&eacute;niosit&eacute;. La solution a &eacute;t&eacute; de privil&eacute;gier un groupement particulier (comme la dizaine, la douzaine, la vingtaine ou la soixantaine, par exemple) et d'organiser la suite r&eacute;guli&egrave;re des nombres selon une classification organis&eacute;e fond&eacute;e sur ce groupement originel. Autrement dit, on a convenu d'une &laquo;&eacute;chelle&raquo; &agrave; partir de laquelle il est possible de r&eacute;partir les nombres et leurs divers symboles suivant des paliers successifs, auxquels on peut donner les noms respectifs de : unit&eacute;s du premier ordre, unit&eacute;s du deuxi&egrave;me ordre, unit&eacute;s du troisi&egrave;me ordre, et ainsi de suite ... . Et c'est de cette fa&ccedil;on que l'on est parvenu &agrave; une symbolisation structur&eacute;e des nombres, permettant d'&eacute;viter des efforts de m&eacute;moire consid&eacute;rables.</font></font>
<p><font face="Arial,Helvetica"><font size=+1>C'est ce que l'on appelle
le principe de la base. Sa d&eacute;couverte a marqu&eacute; la naissance
des syst&egrave;mes de num&eacute;ration : syst&egrave;mes dont la base
n'est autre que le nombre d'unit&eacute;s qu'il est n&eacute;cessaire de
grouper, &agrave; l'int&eacute;rieur d'un ordre donn&eacute;, pour former
une unit&eacute; de l'ordre sup&eacute;rieur.</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;Selon que ce principe
a &eacute;t&eacute; appliqu&eacute; &agrave; des instruments, &agrave;
des mots d'une langue ou&nbsp; &agrave; des signes graphiques, il a donc
donn&eacute; le jour &agrave; des num&eacute;rations concr&egrave;tes,
orales ou &eacute;crites ...&nbsp;</font></font>
<br>&nbsp;
<br>&nbsp;
<br>
<br>
<center>
<p><b><font face="Arial,Helvetica"><font size=+1>3) La base d&eacute;cimale
: la plus courante</font></font></b><a NAME="cib3"></a></center>

<p><font face="Arial,Helvetica"><font size=+1>&nbsp;Il n'y pas si longtemps encore, dans certaines r&eacute;gions d'Afrique occidentale, les bergers avaient une coutume bien pratique pour d&eacute;nombrer un troupeau. On faisait d&eacute;filer les b&ecirc;tes les unes derri&egrave;re les autres. Au passage de la premi&egrave;re, on enfilait un coquillage &agrave; une lani&egrave;re blanche, un autre coquillage &agrave; la deuxi&egrave;me, et ainsi de suite. Au passage du dixi&egrave;me animal, on d&eacute;faisait le collier et on enfilait un coquillage &agrave; une lani&egrave;re bleue associ&eacute; aux dizaines. Puis on recommen&ccedil;ait &agrave; enfiler des coquilles &agrave; la lani&egrave;re blanche jusqu'au passage du vingti&egrave;me animal, ou l'on enfilait un deuxi&egrave;me coquillage &agrave; la lani&egrave;re bleue. Quand celle-ci contenait &agrave; son tour dix coquillages, cent b&ecirc;tes ayant alors &eacute;t&eacute; compt&eacute;es, on d&eacute;faisait le collier des dizaines et l'on enfilait un coquillage &agrave; une lani&egrave;re rouge, r&eacute;serv&eacute;e cette fois aux centaines. Et ainsi de suite jusqu'&agrave; l'ach&egrave;vement du compte des animaux. Au d&eacute;nombrement de 258 b&ecirc;tes, par exemple, huit coquillage se trouvait enfil&eacute;s &agrave; la lani&egrave;re blanche, 5 &agrave; la bleue et 2 &agrave; la rouge.</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp; N'allons cependant
pas croire que ces gens l&agrave; raisonnaient en &laquo;primitifs&raquo;
: nous comptons encore suivant le m&ecirc;me principe qu'eux mais avec&nbsp;
des symboles diff&eacute;rents.</font></font>
<center><img SRC="../../Images/T1p250f10.gif" NOSAVE BORDER=0 height=156 width=149></center>

<p><font face="Arial,Helvetica"><font size=+1>&nbsp;L'id&eacute;e fondamentale
de ce proc&eacute;d&eacute; r&eacute;side en effet dans l'importance du
groupement (et du rythme des symboles de la s&eacute;rie r&eacute;guli&egrave;re)
par dizaines (ou &laquo;paquets&raquo; de dix), centaines (ou &laquo;paquets&raquo;
de dix dizaines), milliers (ou &laquo;paquets&raquo; de dix centaines),
etc .... Dans cette technique concr&egrave;te, chaque coquillage de la
lani&egrave;re blanche compte pour une unit&eacute; simple, chaque coquillage
de la lani&egrave;re bleue compte pour dix, tandis qu'un coquillage de
la lani&egrave;re rouge marque un groupement de cent unit&eacute;s&nbsp;
(ou de dix dizaines). C'est ce que l'on appelle &laquo;le principe de la
base dix&raquo;. Nous avons l&agrave; un exemple de num&eacute;ration concr&egrave;te
d&eacute;cimale.&nbsp;</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;Naturellement, au
lieu d'utiliser des coquillages et des lani&egrave;res, ce principe pourrait
&ecirc;tre aussi bien appliqu&eacute; &agrave; des mots qu'&agrave;&nbsp;
des signes graphiques : on obtiendrait alors des num&eacute;rations orales
ou &eacute;crites de base dix.</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;Notre num&eacute;ration
&eacute;crite actuelle proc&egrave;de de la m&ecirc;me fa&ccedil;on, mais
elle se sert des symboles graphiques suivants (auxquels on donne souvent
le nom de chiffres arabes) :&nbsp;</font></font>
<center>
<p><font face="Arial,Helvetica"><font size=+4>1&nbsp; 2&nbsp; 3&nbsp; 4&nbsp;
5&nbsp; 6&nbsp; 7&nbsp; 8&nbsp; 9&nbsp; 0</font></font></center>

<p><font face="Arial,Helvetica"><font size=+1>Les neufs premiers symboles
figurent les unit&eacute;s simples (ou unit&eacute;s du premier ordre d&eacute;cimal).
Il sont soumis au principe de position, puisque leur valeur varie en fonction
de la position qu'ils occupent dans l'&eacute;criture du nombre (un 3,
par exemple, valant trois unit&eacute;s, trois dizaines ou trois centaines
selon qu'il occupe la premi&egrave;re, la deuxi&egrave;me ou le troisi&egrave;me
position dans une telle repr&eacute;sentation chiffr&eacute;e).</font></font>
<br><font face="Arial,Helvetica"><font size=+1>Quant au dixi&egrave;me
symbole, il repr&eacute;sente ce que l'on appelle le &laquo;z&eacute;ro&raquo;
: il sert &agrave; marquer l'absence de chiffres d'un certain ordre ; il
a aussi le sens du &laquo;nombre nul&raquo;, r&eacute;sultat, par exemple,
de la soustraction d'un nombre par lui-m&ecirc;me.</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;Dix, qui est le premier
nombre repr&eacute;sent&eacute; au moyen de deux chiffres, s'&eacute;crit
: 10 (notation qui n'est autre qu'une forme abr&eacute;g&eacute;e de l'expression
&laquo;1 dizaine, 0 unit&eacute;&raquo; ).</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;On repr&eacute;sente
ensuite les nombres de 1 &agrave; 99 en combinant successivement deux de
ces chiffres (selon la r&egrave;gle de position):</font></font>
<center><img SRC="../../Images/tableau.gif" NOSAVE BORDER=0 height=96 width=279></center>

<p><font face="Arial,Helvetica"><font size=+1>La centaine, qui est &eacute;gale
au carr&eacute; de la base, s'&eacute;crit : 100 (ce qui signifie : &laquo;1
centaine, 0 dizaine, 0 unit&eacute;&raquo; ) : c'est le plus petit nombre
repr&eacute;sent&eacute; de cette mani&egrave;re, au moyen de trois chiffres.</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;Les nombres de 101
&agrave; 999 sont not&eacute;s en combinant successivement trois des dix
chiffres fondamentaux :</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp; 101&nbsp;&nbsp; (&laquo;1
centaine, 0 dizaine, 1 unit&eacute;&raquo;)</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp; 358&nbsp;&nbsp; (&laquo;3
centaines, 5 dizaines, 8 unit&eacute;s&raquo;), etc ...</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;Vient ensuite le millier,
qui est &eacute;gal au cube de la base, et que l'on &eacute;crit sous la
forme :&nbsp; 1 000 (&laquo;1 millier, 0 centaine, 0 dizaine, 0 unit&eacute;&raquo;)
; c'est le plus petit nombre repr&eacute;sent&eacute; au moyen de quatre
chiffres.</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;Puis, c'est au tour
de la dizaine de mille, quatri&egrave;me puissance de la base, que l'on
note : 10 000 (&laquo;1 dizaine de mille, 0 millier, 0 centaine, 0 dizaine,
0 unit&eacute;&raquo;) ; c'est le plus petit nombre repr&eacute;sent&eacute;
au moyen de cinq chiffres.</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;Dans les num&eacute;rations orales construites sur cette base, les choses se d&eacute;roulent &eacute;videmment sur la m&ecirc;me toile de fond, avec toute fois cette diff&eacute;rence, essentielle &agrave; la structure des langues parl&eacute;es : tous les nombres inf&eacute;rieurs ou &eacute;gaux &agrave; dix, ainsi que les diverses puissances de dix (100, 1 000, 10 000, etc), re&ccedil;oivent chacun un nom individuel, totalement ind&eacute;pendant, tandis que les autres nombres sont exprim&eacute;s par des mots (ou expressions) &laquo;compos&eacute;s&raquo; &agrave; partir des pr&eacute;c&eacute;dents.</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;En prenant les mots
de notre langue et en consid&eacute;rant dans ce qui suit que les nombres
cardinaux, cette nomenclature se fait donc - th&eacute;oriquement du moins
- de la mani&egrave;re suivante.&nbsp;</font></font>
<p><font face="Arial,Helvetica"><font size=+1>Les dix premiers nombres
re&ccedil;oivent chacun un nom&nbsp; particulier :&nbsp;</font></font>
<center>
<p><font face="Arial,Helvetica"><font size=+2>1&nbsp;&nbsp; 2&nbsp;&nbsp;
3&nbsp;&nbsp; 4&nbsp;&nbsp; 5&nbsp;&nbsp; 6&nbsp;&nbsp; 7&nbsp;&nbsp; 8&nbsp;&nbsp;
9&nbsp; 10</font></font>
<br><font face="Arial,Helvetica"><font size=+2>&nbsp;un&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
deux&nbsp;&nbsp;&nbsp;&nbsp; trois&nbsp;&nbsp;&nbsp;&nbsp; quatre&nbsp;&nbsp;&nbsp;&nbsp;
cinq&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; six&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
sept&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; huit&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
neuf&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; dix</font></font></center>

<p><font face="Arial,Helvetica"><font size=+1>Les neuf premiers sont les
&laquo;unit&eacute;s du premier ordre d&eacute;cimal&raquo;. Le dernier,
lui, constitue la &laquo;base&raquo; du&nbsp; syst&egrave;me (et marque
par d&eacute;finition une &laquo;unit&eacute; du deuxi&egrave;me ordre&raquo;).</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;Pour d&eacute;signer
les nombres de 11 &agrave; 19, on groupe les unit&eacute;s par paquets
de dix et on proc&egrave;de tout simplement par addition :&nbsp;</font></font>
<center><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp;&nbsp;&nbsp;
11 dix-un&nbsp;&nbsp;&nbsp;&nbsp; (= 10 + 1 )</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp;&nbsp;&nbsp;
15&nbsp;&nbsp;&nbsp; dix-cinq&nbsp;&nbsp;&nbsp;&nbsp; (= 10 + 5 ), etc.</font></font></center>
<font face="Arial,Helvetica"><font size=+1>&nbsp;Les multiples de la base,
de 20 &agrave; 90, sont les dizaines ou &laquo;unit&eacute;s du deuxi&egrave;me
ordre d&eacute;cimal&raquo;. On les exprime en proc&eacute;dant cette fois
par multiplication :</font></font>
<center><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp;&nbsp;&nbsp;
20&nbsp;&nbsp;&nbsp; deux-dix&nbsp;&nbsp;&nbsp;&nbsp; (= 2 x 10 )</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp;&nbsp;&nbsp;
40&nbsp;&nbsp;&nbsp; quatre-dix&nbsp;&nbsp;&nbsp;&nbsp; (= 4 x 10 ), etc.</font></font></center>
<font face="Arial,Helvetica"><font size=+1>&nbsp;Si le nombre des dizaines
est lui-m&ecirc;me sup&eacute;rieur ou &eacute;gal &agrave; dix, on les
groupe &agrave; leur tour par paquets de dix, et l'on obtient ainsi les
centaines ou &laquo;unit&eacute;s du troisi&egrave;me ordre d&eacute;cimal&raquo;,
suivant le mod&egrave;le ci-apr&egrave;s :</font></font>
<center><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp;&nbsp;&nbsp;
100&nbsp;&nbsp; cent&nbsp;&nbsp;&nbsp;&nbsp; (=10<sup>2</sup> )</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp;&nbsp;&nbsp;
300&nbsp;&nbsp; trois-cent&nbsp;&nbsp;&nbsp;&nbsp; (= 3 x 100 ), etc.</font></font></center>
<font face="Arial,Helvetica"><font size=+1>&nbsp;En groupant les centaines
&agrave; leur tour par paquets de dix, on obtient les milliers ou &laquo;unit&eacute;s
du quatri&egrave;me ordre d&eacute;cimal&raquo; :</font></font>
<center><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp;&nbsp;&nbsp;
1000 mille&nbsp;&nbsp;&nbsp;&nbsp; (= 10<sup>3</sup> )</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp;&nbsp;&nbsp;
5000 cinq-mille&nbsp;&nbsp;&nbsp;&nbsp; (= 5 x 1000 ), etc.</font></font></center>
<font face="Arial,Helvetica"><font size=+1>&nbsp;Viennent ensuite les myriades
(ou dizaines de mille), qui correspondent aux &laquo;unit&eacute;s du cinqui&egrave;me
ordre d&eacute;cimal&raquo; :</font></font>
<center><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp;&nbsp;&nbsp;
10000 une myriade&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (= 10<sup>4</sup>
)</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp;&nbsp;&nbsp;
20000 deux myriades&nbsp;&nbsp;&nbsp; (= 2 x 10000 ), etc.</font></font></center>
<font face="Arial,Helvetica"><font size=+1>&nbsp;A partir des mots pr&eacute;c&eacute;dents,
on obtiendra d&egrave;s lors les noms des autres nombres en forgeant des
expressions respectant l'ordre des puissances d&eacute;croissantes de dix
et compos&eacute;es selon un principe &agrave; la fois additif et multiplicatif
:</font></font>
<br /><br />
<center><table WIDTH="600" >
<tr>
<td><font face="Arial,Helvetica"><font size=+3>74 238</font></font></td>

<td>
<center><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp;&nbsp; sept
myriades&nbsp;&nbsp;&nbsp; quatre-mille&nbsp;&nbsp;&nbsp; deux-cent&nbsp;&nbsp;
trois-dix&nbsp;&nbsp;&nbsp; huit</font></font></center>
<font face="Arial,Helvetica"><font size=+1>(= 7 x 10 000&nbsp;&nbsp;&nbsp; +&nbsp; 4 x 1 000&nbsp;&nbsp;&nbsp; +&nbsp;&nbsp;
2 x 100&nbsp; +&nbsp; 3 x 10&nbsp;&nbsp; +&nbsp; 8&nbsp;&nbsp;&nbsp; )</font></font></td>
</tr>
</table>
<br />
<br /></center>
<font face="Arial,Helvetica"><font size=+1>&nbsp;Telles sont donc les grandes
lignes de la formation des noms des nombres cardinaux selon la base d&eacute;cimale.</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;Il a &eacute;videmment
fallu beaucoup de temps pour que l'homme parvienne &agrave; une mani&egrave;re
aussi parfaite d'exprimer les nombres, qui rel&egrave;ve sans aucun doute
d'une grande intelligence. Il s'agit l&agrave; cependant d'un principe
purement th&eacute;orique que les peuples n'ont pas tous scrupuleusement
suivi &agrave; la lettre au cours de l'histoire, chacun l'ayant adapt&eacute;
&agrave; ses propres traditions orales et aux r&egrave;gles de sa propre
langue.&nbsp;</font></font>
<center>
<p><b><font face="Arial,Helvetica"><font size=+1>4) Les autres bases existantes</font></font></b><a NAME="cib4"></a></center>

<p><font face="Arial,Helvetica"><font size=+1>&nbsp;La raison de l'adoption
de la base vingt par certaines cultures vient du fait&nbsp;</font></font>
<br><font face="Arial,Helvetica"><font size=+1>que l'homme poss&egrave;de
vingt doigts et orteils sur lesquels il peut compter. En effet, comme dans
la num&eacute;ration azt&egrave;que :&nbsp;</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp; - les cinq
premiers noms de nombres peuvent &ecirc;tre associ&eacute;s aux cinq doigts
d'une main ;</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp; - les cinq
suivants aux cinq doigts de l'autre ;</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp; - les cinq
autres encore aux cinq orteils d'un pied ;</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp; - et les cinq
derniers aux cinq orteils de l'autre orteil.</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;En sorte qu'au&nbsp;
dernier doigt de pied, la vingtaine soit atteinte.</font></font>
<center>
<p><img SRC="../../Images/T1p114f2.gif" NOSAVE BORDER=0 height=454 width=307></center>

<p><font face="Arial,Helvetica"><font size=+1>&nbsp;Ce rapprochement n'est
&eacute;videmment pas le fait du hasard : c'&eacute;tait parce que certains
peuples s'&eacute;taient rendus compte qu'en se penchant un petit peu,
on pouvait compter aussi sur ses orteils, qu'ils avaient adopt&eacute;
la base vingt.</font></font>
<p><font face="Arial,Helvetica"><font size=+1>&nbsp;L'origine de la base
cinq est &eacute;galement <a href="../../page_themes.html#anthropomorphique">anthropomorphique</a>
(li&eacute; au corps ) : cette mani&egrave;re de compter a trouv&eacute;
sa raison d'&ecirc;tre dans bien des cas chez les peuples qui ont appris
&agrave; compter sur une seule main.</font></font>
<br><font face="Arial,Helvetica"><font size=+1>&nbsp;La technique digitale
ci-apr&egrave;s nous donne en tout cas une id&eacute;e tr&egrave;s nette
de la mani&egrave;re dont se compte manuel primitif a donn&eacute; naissance
&agrave; une &eacute;laboration sup&eacute;rieure.</font></font>
<center>
<p><img SRC="../../Images/T1p115f2.gif" NOSAVE BORDER=0 height=255 width=303></center>

<p><font face="Arial,Helvetica"><font size=+1>&nbsp;&nbsp; On compte d'abord les cinq premi&egrave;res unit&eacute;s en &eacute;tendant successivement les doigts de la main gauche. Une fois ce nombre atteint, on replie ensuite le pouce droit, puis on continue de compter jusqu'&agrave; dix en &eacute;tendant de nouveau les doigts de la main gauche, apr&egrave;s quoi on replie l'index droit pour enregistrer les unit&eacute;s suppl&eacute;mentaires ainsi consid&eacute;r&eacute;es. On peut donc compter de la sorte jusqu'&agrave; 25. Et si cela ne suffit pas, on peut m&ecirc;me prolonger l'op&eacute;ration jusqu'&agrave; trente en revenant une fois de plus aux doigts de la main gauche redevenue libre.</font></font>
<br>&nbsp;
<p><font face="Arial,Helvetica"><font size=+1>&nbsp;</font></font></td>
</tr>
</table>

</p>

</div>

 <div id="footer">
    Copyright Cyril / Nicolas / Pierre 2011
  </div>
</div>
</body>
</html>
